{
  "innocence": {
    "fabio": "This quote defines innocence as a state of ignorance because she has no idea that the same lessons would later make her loneliness so much harder to handle.",
    "mateus": "This highlights the tragic irony of her \"rescue\": her innocence becomes a weapon forged against her future self as that very education will later lead to her suffering."
  },
  "recognition": {
    "fabio": "Ourika faces the harsh truth: the people she thought were her friends don't treat her like one. They look after her, but they don't see her as an equal.",
    "mateus": "Ourika realizes that her social position, defined by her race, limits her from forming true friendships, reflecting her doll-like treatment."
  },
  "exclusion": {
    "fabio": "The word \"revenge\" makes it clear this isn't an accident, it's a punishment for being where she doesn't belong.",
    "mateus": "Exclusion is framed here not as indifference, but as an active retaliation by society against Ourika for daring to step outside the boundaries set for her."
  },
    "isolation": {
        "fabio": "This shows her loneliness isn't just about being alone, but about feeling invisible in the hearts of the only family she's ever known.",
        "mateus": "This moment reveals the painful understanding that her emotional bonds were an illusion, and her love existed without reciprocity."
    },
    "desire": {
        "fabio": "The \"vulture\" image represents her repressed internal envy which is destroying her from the inside out.",
        "mateus": "Her desire reflects romantic feelings for Charles, maternal responsibilities, and social belonging; all embodying a domestic life from which she is racially excluded."
    },
    "resignation": {
        "fabio": "Her final choice is to lock herself away with all her pain because it's too hard to stay and watch Charles live his full life without her.",
        "mateus": "Resignation here is presented not as spiritual peace, but as a retreat to a place where she may may quietly degrade, away from her cruel world."
    }
}
